#include "music.h"

class note
{
public:
    int t0;//开始时间
    int t1;//持续时间
    int h[2];//音高
};

int main()//自动作曲部分
{
    int l;
    FILE *temp,*nn;
    music m;
    note n;
    l=m.play(4);//根据先前的分析结果生成音乐

    //需放置于同一目录下
    temp=fopen("temp.txt","r");//把play生成的东西读出来
    nn=fopen("nn.nn","w");

    fprintf(nn,"100.0 4 4 100 19 0 0 0 0 0\n");
    fprintf(nn,"%d\n",l);
    while(fscanf(temp,"%d %d %d",&n.t0,&n.t1,&n.h[0])!=EOF)//分析生成的作曲文件构造数据库
    {
        int hnn;
        n.h[1]=n.h[0]%10;
        n.h[0]=n.h[0]/10;
        switch(n.h[1])
        {
        case 1:n.h[1]=1;break;
        case 2:n.h[1]=3;break;
        case 3:n.h[1]=5;break;
        case 4:n.h[1]=6;break;
        case 5:n.h[1]=8;break;
        case 6:n.h[1]=10;break;
        case 7:n.h[1]=12;break;
        }
        hnn=48-(n.h[1]+n.h[0]*12);
		//把生成的配乐写入袅袅（应该在结构上和写入wav同级，这里这么写不好）
        fprintf(nn," a a %d %d %d 50 50 0 0 0 0 100,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50 100,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50,50 0\n",n.t0,n.t1,hnn);
    }
    fclose(temp);
    fclose(nn);
    return 0;
}
